HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_regdef.h
/** \\brief  External Control Register D */
typedef struct _Ifx_XBAR_EXTCOND_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int WFWD:1;                    /**< \brief [3:3] Wait for FPI Write Data (rw) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int FREQDISF:1;                /**< \brief [6:6] Disable Fast Request Feature for FPI to SRI Transactions (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NODELTR:1;                 /**< \brief [9:9] Control Signal for deferred transactions (rw) */
    unsigned int NORMW:1;                   /**< \brief [10:10] Control Signal for deferred transactions (rw) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int MAX_WS:7;                  /**< \brief [19:13] FPI-Bus Wait State Retry Ratio (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_EXTCOND_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_XBAR_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_XBAR_ID_Bits;

/** \\brief  Transaction ID Interrupt Enable Register */
typedef struct _Ifx_XBAR_IDINTEN_Bits
{
    unsigned int ENSCI0:1;                  /**< \brief [0:0] Enable ID Error from SCI0 (rw) */
    unsigned int ENSCI1:1;                  /**< \brief [1:1] Enable ID Error from SCI1 (rw) */
    unsigned int ENSCI2:1;                  /**< \brief [2:2] Enable ID Error from SCI2 (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int ENSCI4:1;                  /**< \brief [4:4] Enable ID Error from SCI4 (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int ENSCI6:1;                  /**< \brief [6:6] Enable ID Error from SCI6 (rw) */
    unsigned int ENSCI7:1;                  /**< \brief [7:7] Enable ID Error from SCI7 (rw) */
    unsigned int ENSCI8:1;                  /**< \brief [8:8] Enable ID Error from SCI8 (rw) */
    unsigned int reserved_9:6;              /**< \brief \internal Reserved */
    unsigned int ENSCID:1;                  /**< \brief [15:15] Enable ID Error from Default Slave (rw) */
    unsigned int ENMCI0:1;                  /**< \brief [16:16] Enable ID Error from MCI0 (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int ENMCI4:1;                  /**< \brief [20:20] Enable ID Error from MCI4 (rw) */
    unsigned int ENMCI5:1;                  /**< \brief [21:21] Enable ID Error from MCI5 (rw) */
    unsigned int ENMCI6:1;                  /**< \brief [22:22] Enable ID Error from MCI6 (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int ENMCI8:1;                  /**< \brief [24:24] Enable ID Error from MCI8 (rw) */
    unsigned int ENMCI9:1;                  /**< \brief [25:25] Enable ID Error from MCI9 (rw) */
    unsigned int ENMCI10:1;                 /**< \brief [26:26] Enable ID Error from MCI10 (rw) */
    unsigned int ENMCI11:1;                 /**< \brief [27:27] Enable ID Error from MCI11 (rw) */
    unsigned int ENMCI12:1;                 /**< \brief [28:28] Enable ID Error from MCI12 (rw) */
    unsigned int ENMCI13:1;                 /**< \brief [29:29] Enable ID Error from MCI13 (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTEN_Bits;

/** \\brief  Transaction ID Interrupt Status Register */
typedef struct _Ifx_XBAR_IDINTSAT_Bits
{
    unsigned int IDCSCI0:1;                 /**< \brief [0:0] Transaction ID Error from SCI0 Status (rwh) */
    unsigned int IDCSCI1:1;                 /**< \brief [1:1] Transaction ID Error from SCI1 Status (rwh) */
    unsigned int IDCSCI2:1;                 /**< \brief [2:2] Transaction ID Error from SCI2 Status (rwh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int IDCSCI4:1;                 /**< \brief [4:4] Transaction ID Error from SCI4 Status (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int IDSCI6:1;                  /**< \brief [6:6] Transaction ID Error from SCI6 Status (rwh) */
    unsigned int IDSCI7:1;                  /**< \brief [7:7] Transaction ID Error from SCI7 Status (rwh) */
    unsigned int IDSCI8:1;                  /**< \brief [8:8] Transaction ID Error from SCI8 Status (rwh) */
    unsigned int reserved_9:6;              /**< \brief \internal Reserved */
    unsigned int IDSCID:1;                  /**< \brief [15:15] Transaction ID Error from Default Slave Status (rwh) */
    unsigned int IDMCI0:1;                  /**< \brief [16:16] Transaction ID Error from MCI0 Status (rwh) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int IDMCI4:1;                  /**< \brief [20:20] Transaction ID Error from MCI4 Status (rwh) */
    unsigned int IDMCI5:1;                  /**< \brief [21:21] Transaction ID Error from MCI5 Status (rwh) */
    unsigned int IDMCI6:1;                  /**< \brief [22:22] Transaction ID Error from MCI6 Status (rwh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int IDMCI8:1;                  /**< \brief [24:24] Transaction ID Error from MCI8 Status (rwh) */
    unsigned int IDMCI9:1;                  /**< \brief [25:25] Transaction ID Error from MCI9 Status (rwh) */
    unsigned int IDMCI10:1;                 /**< \brief [26:26] Transaction ID Error from MCI10 Status (rwh) */
    unsigned int IDMCI11:1;                 /**< \brief [27:27] Transaction ID Error from MCI11 Status (rwh) */
    unsigned int IDMCI12:1;                 /**< \brief [28:28] Transaction ID Error from MCI12 Status (rwh) */
    unsigned int IDMCI13:1;                 /**< \brief [29:29] Transaction ID Error from MCI13 Status (rwh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTSAT_Bits;

/** \\brief  Arbiter Interrupt Status Register */
typedef struct _Ifx_XBAR_INTSAT_Bits
{
    unsigned int SCSCI0:1;                  /**< \brief [0:0] Starvation Error from SCI0 Status (rwh) */
    unsigned int SCSCI1:1;                  /**< \brief [1:1] Starvation Error from SCI1 Status (rwh) */
    unsigned int SCSCI2:1;                  /**< \brief [2:2] Starvation Error from SCI2 Status (rwh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int SCSCI4:1;                  /**< \brief [4:4] Starvation Error from SCI4 Status (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int SCSCI6:1;                  /**< \brief [6:6] Starvation Error from SCI6 Status (rwh) */
    unsigned int SCSCI7:1;                  /**< \brief [7:7] Starvation Error from SCI7 Status (rwh) */
    unsigned int SCSCI8:1;                  /**< \brief [8:8] Starvation Error from SCI8 Status (rwh) */
    unsigned int reserved_9:6;              /**< \brief \internal Reserved */
    unsigned int SCSCID:1;                  /**< \brief [15:15] Starvation Error from Default Slave Status (rwh) */
    unsigned int PRSCI0:1;                  /**< \brief [16:16] Protocol Error from SCI0 Status (rwh) */
    unsigned int PRSCI1:1;                  /**< \brief [17:17] Protocol Error from SCI1 Status (rwh) */
    unsigned int PRSCI2:1;                  /**< \brief [18:18] Protocol Error from SCI2 Status (rwh) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int PRSCI4:1;                  /**< \brief [20:20] Protocol Error from SCI4 Status (rwh) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int PRSCI6:1;                  /**< \brief [22:22] Protocol Error from SCI6 Status (rwh) */
    unsigned int PRSCI7:1;                  /**< \brief [23:23] Protocol Error from SCI7 Status (rwh) */
    unsigned int PRSCI8:1;                  /**< \brief [24:24] Protocol Error from SCI8 Status (rwh) */
    unsigned int reserved_25:6;             /**< \brief \internal Reserved */
    unsigned int PRSCID:1;                  /**< \brief [31:31] Protocol Error from Default Slave Status (rwh) */
} Ifx_XBAR_INTSAT_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOH_Bits
{
    unsigned int MASTER8:3;                 /**< \brief [2:0] Master 8 Priority (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int MASTER9:3;                 /**< \brief [6:4] Master 9 Priority (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int MASTER10:3;                /**< \brief [10:8] Master 10 Priority (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MASTER11:3;                /**< \brief [14:12] Master 11 Priority (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int MASTER12:3;                /**< \brief [18:16] Master 12 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER13:3;                /**< \brief [22:20] Master 13 Priority (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOH_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOL_Bits
{
    unsigned int MASTER0:3;                 /**< \brief [2:0] Master 0 Priority (rw) */
    unsigned int reserved_3:13;             /**< \brief \internal Reserved */
    unsigned int MASTER4:3;                 /**< \brief [18:16] Master 4 Priority (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MASTER5:3;                 /**< \brief [22:20] Master 5 Priority (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int MASTER6:3;                 /**< \brief [26:24] Master 6 Priority (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN0_Bits B;
} Ifx_XBAR_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN1_Bits B;
} Ifx_XBAR_ACCEN1;

/** \\brief  Arbiter Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBCON_Bits B;
} Ifx_XBAR_ARBCON;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBADD_Bits B;
} Ifx_XBAR_ARBITER0_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBMADD_Bits B;
} Ifx_XBAR_ARBITER0_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBADD_Bits B;
} Ifx_XBAR_ARBITER1_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBMADD_Bits B;
} Ifx_XBAR_ARBITER1_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBADD_Bits B;
} Ifx_XBAR_ARBITER2_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBMADD_Bits B;
} Ifx_XBAR_ARBITER2_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBADD_Bits B;
} Ifx_XBAR_ARBITER4_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBMADD_Bits B;
} Ifx_XBAR_ARBITER4_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBADD_Bits B;
} Ifx_XBAR_ARBITER6_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBMADD_Bits B;
} Ifx_XBAR_ARBITER6_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBADD_Bits B;
} Ifx_XBAR_ARBITER7_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBMADD_Bits B;
} Ifx_XBAR_ARBITER7_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBADD_Bits B;
} Ifx_XBAR_ARBITER8_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBMADD_Bits B;
} Ifx_XBAR_ARBITER8_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBADD_Bits B;
} Ifx_XBAR_ARBITERD_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBMADD_Bits B;
} Ifx_XBAR_ARBITERD_DBMADD;

/** \\brief  Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBCON_Bits B;
} Ifx_XBAR_DBCON;

/** \\brief  Debug Trigger Event Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBSAT_Bits B;
} Ifx_XBAR_DBSAT;

/** \\brief  Error/Debug Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERR_Bits B;
} Ifx_XBAR_ERR;

/** \\brief  Error/Debug Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERRADDR_Bits B;
} Ifx_XBAR_ERRADDR;

